app/controllers/administrator/pacientes_controller.rb

def buscar
   @paciente = Paciente.new
   @pacientes = Usuario.new
   @@mensaje = ""

  if params[:paciente]
      if (params[:paciente][:datoBuscar].present?)
          @pacientes = Usuario.aplicar_comparacion_campo(params[:paciente][:datoBuscar])
          if @pacientes.class.to_s != "String"
              @pacientes = @pacientes.paginate(:page => params[:page], :per_page => 10)
---
SELECT  "usuarios".* FROM "usuarios" WHERE (nombre ILIKE '%ana%')  ORDER BY apellido LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "usuarios" WHERE (apellido ILIKE '%ana maria%')

def buscarFrasco
   @paciente = Paciente.new
   @pacientes = Usuario.new
   @@mensaje = ""

  if params[:paciente]
      if (params[:paciente][:datoBuscar].present?)
          @pacientes = Usuario.aplicar_comparacion_campo(params[:paciente][:datoBuscar])
          if @pacientes.class.to_s != "String"
              @pacientes = @pacientes.paginate(:page => params[:page], :per_page => 10)
---
SELECT  "usuarios".* FROM "usuarios" WHERE (nombre ILIKE '%andrea%')  ORDER BY apellido LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "usuarios" WHERE (apellido ILIKE '%andrea soto%')

def buscarPruebas
   @paciente = Paciente.new
   @pacientes = Usuario.new
   @@mensaje = ""

  if params[:paciente]
      if (params[:paciente][:datoBuscar].present?)
          @pacientes = Usuario.aplicar_comparacion_campo(params[:paciente][:datoBuscar])
          if @pacientes.class.to_s != "String"
              @pacientes = @pacientes.paginate(:page => params[:page], :per_page => 10)
---
SELECT  "usuarios".* FROM "usuarios" WHERE (nombre ILIKE '%andrea%')  ORDER BY apellido LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "usuarios" WHERE (nombre ILIKE '%andrea%')

def show
   @paciente = Usuario.find(params[:format])
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1  ORDER BY "usuarios"."id" ASC LIMIT 1  [["id", 3]]

    def set_pacientes
      @paciente = Usuario.find(params[:id])
---
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1  ORDER BY "usuarios"."id" ASC LIMIT 1  [["id", 3]]