app/controllers/registrations_controller.rb

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."rol" = $1  [["rol", 3]]
---
def index
  @pacientes = Usuario.where(rol: 3)

SELECT  "usuarios".* FROM "usuarios"  ORDER BY "usuarios"."id" DESC LIMIT 1
---
def new
  @numero_paciente = Usuario.last.numero_excel.to_i + 1

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1  ORDER BY "usuarios"."id" ASC LIMIT 1  [["id", 3]]
---
def editPaciente
  @paciente = Usuario.find(params[:id])

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1  ORDER BY "usuarios"."id" ASC LIMIT 1  [["id", 3]]
---
def editPrueba
  puts "ESTOY EN EDIT PRUEBA"
  @paciente = Usuario.find(params[:id])

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1  ORDER BY "usuarios"."id" ASC LIMIT 1  [["id", 3]]
---
def showFrascos
  puts "ESTOY EN SHOW FRASCOS"
  @paciente = Usuario.find(params[:id])

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1  ORDER BY "usuarios"."id" ASC LIMIT 1  [["id", 79]]
---
def showFrascosPaciente
  puts "ESTOY EN SHOW FRASCOS"
  @paciente = Usuario.find(params[:id])

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1  ORDER BY "usuarios"."id" ASC LIMIT 1  [["id", 3]]
SELECT  "usuarios".* FROM "usuarios"  ORDER BY "usuarios"."id" DESC LIMIT 1
UPDATE "usuarios" SET "estado" = $1, "ava" = $2, "cuc" = $3, "hong" = $4, "berm" = $5, "john" = $6, "asp" = $7, "blom" = $8, "fecha_pruebas" = $9, "email" = $10 WHERE "usuarios"."id" = $11  [["estado", 1], ["ava", 2], ["cuc", 2], ["hong", 2], ["berm", 2], ["john", 2], ["asp", 2], ["blom", 2], ["fecha_pruebas", "04-07-2016"], ["email", "gueliandrea@gmail.com"], ["id", 1642]]
---
def update
  puts "UPDATE"
  puts params[:usuario][:id]
  puts "OCULTO"
  puts params[:usuario][:origen]
  if "editPrueba".eql? params[:usuario][:origen]
    puts "CAI EN EL IF"
     @paciente = Usuario.find(params[:usuario][:id])
  if @paciente != current_usuario
    @numero_paciente = Usuario.last.numero_excel.to_i + 1
    #estado = 1 PENDIENTE
    params[:usuario][:estado] = 1
    if params[:usuario][:ava].blank? and
      params[:usuario][:cuc].blank? and
      params[:usuario][:hong].blank? and
      params[:usuario][:berm].blank? and
      params[:usuario][:john].blank? and
      params[:usuario][:aso].blank? and
      params[:usuario][:blom].blank?
      params[:usuario][:fecha_pruebas] = nil
    end

    @paciente = Usuario.find(params[:usuario][:id])
    self.resource = @paciente
    self.resource.saltar_validacion_fecha_nacimiento = false
    self.resource.validar_usuario_nuevo = false
    self.resource.saltar_validacion_correo_principal = false

  if self.resource.update_without_password(pruebas_update_params)

SELECT  "usuarios".* FROM "usuarios"  ORDER BY "usuarios"."id" DESC LIMIT 1
SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."historia" = $1  ORDER BY "usuarios"."id" ASC LIMIT 1  [["historia", "999"]]
---
def create
  @numero_paciente = Usuario.last.numero_excel.to_i + 1
  params[:usuario][:username] = "alerasin"+params[:usuario][:numero_excel]
  params[:usuario][:password] = params[:usuario][:username]
  params[:usuario][:password_confirmation] = params[:usuario][:username]
  params[:usuario][:rol] = 3
  #ESTADO = 1, PENDIENTE
  params[:usuario][:estado] = 1

  if params[:usuario][:ava].blank? and
     params[:usuario][:cuc].blank? and
     params[:usuario][:hong].blank? and
     params[:usuario][:berm].blank? and
     params[:usuario][:john].blank? and
     params[:usuario][:aso].blank? and
     params[:usuario][:blom].blank?
     params[:usuario][:fecha_pruebas] = nil
  end

  build_resource(sign_up_params)
  #respond_to do |format|
  @usuario.saltar_validacion_usuario = false
  @usuario.validar_usuario_nuevo = true
    if resource.save(state: :cambiando_password)
      @paciente = Usuario.where(historia: params[:usuario][:historia]).first

SELECT  "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = $1  ORDER BY "usuarios"."id" ASC LIMIT 1  [["id", 3]]
---
def show
   @paciente = Usuario.find(params[:format])